{"pages":[{"title":"About","text":"Who I am I'm 24 years old graduate school student at Nara Institute of Science and Technology, majoring in information science. My research interest is in Machine learning, Natural language processing, computer vision and deep learning. See more information on my CV . What to do I research on machine translation, dialogue system, machine learning. I love developing web application, studying languages. Skills Natural Languages Japanese(native) English(fluent) Chinese(fluent) Turkish(limited) Cantonese(limited) Programming langueages Proficient Python, R Famillier C, C++, Rust, japascript, Java Other skills Neural Network's frameworks Chainer, Keras, Tensorflow .column-left{ float: left; width: 47.5%; text-align: left; } .column-right{ float: right; width: 47.5%; text-align: left; } .clear{ clear:both; } Education Certificate for Students Achieving the Proficiency Level of Upper Secondary School Graduates 高校卒業認定試験 August, 2010 Tokyo, Japan Waseda University Department of Human Behavior and Environment Sciences April. 2014 - March, 2018 Tokyo, Japan GPA 3.62/4.00 Zhejiang University College of Computer Science and Technology August, 2015 - July, 2016 Zhejiang, China GPA 3.00/4.00 Nara institute of science and technology College of information science, Augmented Human Communication Laboratory April, 2018 - Now Nara, Japan Employments Worked in a Wrecking company manual labour, Parmanent job April, 2009 - March 2011 Saitama, Japan RIKEN Brain Science Institute BTCC RIKEN BSI-TOYOTA Collaboration Center Software Engineer, part-time job July, 2016 - March, 2018 Saitama, Japan Waseda University Teaching Assistant in statistics classes, part-time job September, 2016 - March, 2018 Tokyo, Japan Cookpad inc Machine Learning Engineer, internship August, 2018 Tokyo, Japan mixi inc Machine Learning Engineer, internship September, 2018 Tokyo, Japan Qualifications TOEIC 890 The EIKEN Test in Practical English Proficiency Grade Pre-1 The Society for Testing Chinese Proficiency，Japan Grade 2 HSK6(Chinese Proficiency test) Applied Information Technology Engineer Examination Awards JASSO Scholarship for Study Abroad Program(around ¥800,000). August, 2015 - July, 2016 My future hackathon sponsords award. October 2016 Best Paper award in Waseda University, Department of Human Behavior and Environment Sciences. CONICA MINOLTA hackathon 2017 1st prize CONICA MINOLTA hackathon 2018 1st prize","tags":"pages","url":"https://matasuke.github.io/pages/about.html"},{"title":"Products","text":"Binary classifier between AV idols and Bikini idols This product tells differences between AV idols and Bikini idols based on their faces. AV actresses dataset I made is used for this product. Source code is available here Recommend system for AV actresses This product can tell the differences of more than 1000 AV idols. Web application for searching for similar AV idols from face images. Recommend similar AV actresses from input face images. Source code is available here Scheduling management bot Scheduling management bot using Beacon Tag. you can get notification about one day's appointments and how to change trains to distination and so on, when you go out home. created using Line messaging API. This product is created for My Future Hackathon. awarded for sponsords price. Date me game for fostering your communication skills for dating. created using Oculus HDM and Unity.. This product is created in JP Hacks. Evaluates quality of dialogue by estimating whether or not contents of your speech are positive. please refer to here in detail. AV actresses dataset Now constructing Dataset of AV idols including face images, profiles, titles of their videos and so on. This dataset is used for AV_classifier and binary-classifier-between-bikini-idol-and-AV-adol. thought Assistant Agent for discussion Assistant system for people who attend discussions. It automatically generates related words discussed in meetings. It shows how strong the words are related with other ones. Demonstration video can be available here * アニマル会議 Assistant system to conduct meeting effectively. It offers you Web based anonymous meeting framework. Anyone who attend meeting can't know who mention. All your mentions are flatten and generalized. More information is coming soon. うけトリ see here for detail. find meats!! assistant system for color-blind to know cooked meats when cooking meats. more information is coming soon.","tags":"pages","url":"https://matasuke.github.io/pages/products.html"},{"title":"Research","text":"Research Interests Machine Translation Dialogue System Image Description Generation Generate humor sentences from images automatically and facilitate desire for continueing dialogue(Japanese) NLP2018, Mar, 2018 Supervised by Prof. Hideaki Kikuchi, Waseda University Propose the method to make a humor sentence from images based on incongruity-resolution theory. Recently, many dialogue systems such as Apple's siri, Amazon's alexa are develoved by buch of companies, and are used by many customers. So these kind of system has to continuously be used for a long time because customers use it in daily life. As one of method to let users of dialogue systems use dialogue system continuously, using humor is recognized as a way to let them use it continuously. So in this paper, We propose a method to let user of dialogue system use it for a long time. proposed method is based on incongruity-resolution theory, which is recognized as major theory to explain generating factor of humor, and generate humor sentence from images. As a result of experiments, it found that the method can facilitate continuous dialogue between user of dialogue system and these kind of system.","tags":"pages","url":"https://matasuke.github.io/pages/research.html"}]}